In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [4]:
df_new = df[['AreaName', 1980, 1981]]
df_new = df_new.head()

# Retrieve Index value where condition is satisfied

In [5]:
df_new

  AreaName  1980  1981
0     Asia    16    39
1   Europe     1     0
2   Africa    80    67
3  Oceania     0     1
4   Europe     0     0

#### we will retrieve Index value for that ROW where Europe is there

In [13]:
df_new[df_new["AreaName"] == "Europe"] #This will return a Dataframe

  AreaName  1980  1981
1   Europe     1     0
4   Europe     0     0

In [14]:
df_new[df_new["AreaName"] == "Africa"].index.values.tolist() #Retriving Index Values

[2]

#### We will retrieve Index where value is 67 for col 1981

In [15]:
df_new = df_new.set_index("AreaName")

In [16]:
df_new

          1980  1981
AreaName
Asia        16    39
Europe       1     0
Africa      80    67
Oceania      0     1
Europe       0     0

In [20]:
df_new[df_new[1981] == 67].index.values.tolist()

['Africa']